emacs/major-modes/org.org
#+title: Org Mode Configuration
#+author: Jeff Farr
#+property: header-args:emacs-lisp :tangle org.el
#+auto_tangle: y

* Introduction
This file configures Org mode, the powerful organizational tool at the heart of Emacs.
It includes settings for source blocks, appearance, agenda, export options, and various
org-related packages to enhance the experience.

* Basic Configuration
Setup lexical binding and ensure we're using the right org version.

#+begin_src emacs-lisp
;; -*- lexical-binding: t; -*-

;; Ensure we have a consistent org version
;; This is needed for compatibility with org-roam and other packages
(straight-use-package 'org)

;; ===============================================================================
;; Core Org Mode Settings
;; ===============================================================================

;; Source code blocks settings
(setq org-src-tab-acts-natively t)
(setq org-src-fontify-natively t)

;; Configure Babel languages
(org-babel-do-load-languages 'org-babel-load-languages
                             (append org-babel-load-languages
                                     '((python . t)
                                       (emacs-lisp . t)
                                       (js . t)
                                       (sql . t)
                                       (shell . t))))

;; Python specific settings
(setq org-babel-python-command "python3 2>&1")

;; Wrapping and line handling
(add-hook 'org-mode-hook 'visual-line-mode)
(setq org-startup-truncated nil)
#+end_src

* Display and Appearance
Packages and settings for enhancing the visual appearance of Org mode.

** Horizontal Scrolling
Enables proper horizontal scrolling in Org mode.

#+begin_src emacs-lisp
;; Enable horizontal scrolling
(use-package org-phscroll
  :straight '(org-phscroll :type git :host github :repo "misohena/phscroll"))

(with-eval-after-load "org"
  (require 'org-phscroll))
#+end_src

** Modern Look
Provides a cleaner, more modern appearance to Org mode.

#+begin_src emacs-lisp
;; Modern appearance for org mode
(use-package org-modern
  :straight t)
#+end_src

** Bullets
Replaces stars with nice-looking bullets.

#+begin_src emacs-lisp
;; Replace asterisks with bullets
(use-package org-bullets
  :straight t
  :config
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
#+end_src

** Margin
Enhances the visual appearance of the org file margins.

#+begin_src emacs-lisp
;; Improved margins in Org mode
;; https://github.com/rougier/org-margin
(use-package org-margin
 :straight (org-margin :type git :host github :repo "rougier/org-margin"))

;; TODO add adaptive-wrap-prefix-mode
#+end_src

* Encryption
Configure Org crypt for encrypting sensitive information.

#+begin_src emacs-lisp
;; ===============================================================================
;; Configure Org Crypt
;; ===============================================================================

(require 'org-crypt)
(org-crypt-use-before-save-magic)
(setq org-tags-exclude-from-inheritance (quote ("crypt")))
(setq org-crypt-key nil)
#+end_src

* Export Configuration
Configure various export backends for Org mode.

#+begin_src emacs-lisp
;; ===============================================================================
;; Org Export Engine Config
;; ===============================================================================

;; Jira Export
(use-package ox-jira
  :straight t
  :config
  (setq org-export-copy-to-kill-ring 'if-interactive))
#+end_src

* Task Management
Configure Org mode for task management, TODO lists, and agenda views.

** Priority Settings
Configure priority levels and their appearance.

#+begin_src emacs-lisp
;; Priority range and defaults
(setq org-highest-priority ?A)
(setq org-lowest-priority ?C)
(setq org-default-priority ?A)

;; Priority appearance
(setq org-priority-faces '((?A . (:foreground "#F0DFAF" :weight bold))
                           (?B . (:foreground "LightSteelBlue"))
                           (?C . (:foreground "OliveDrab"))))
#+end_src

** Agenda Configuration
Setup for Org agenda views and files.

#+begin_src emacs-lisp
  ;; Agenda key binding
  (global-set-key (kbd "C-c a") 'org-agenda)

  ;; Agenda files - recursively find all .org files in ~/org/ directory
  (setq org-agenda-files
        (directory-files-recursively "~/org/" "\\.org$"))

  ;; Display sorting for TODO items

  (setq org-agenda-sorting-strategy
        '((agenda time-up priority-down category-up)
          (todo priority-down alpha-up)
          (tags priority-down category-up alpha-up)
          (search category-up)))

  ;; Open agenda in current window
  (setq open-agenda-window-setup (quote current-window))

  ;; Custom agenda views
  ;; From https://blog.aaronbieber.com/2016/09/24/an-agenda-for-life-with-org-mode.html
  (setq org-agenda-custom-commands
        '(("c" "Simple agenda view"
           ((tags "PRIORITY=\"A\""
                  ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                   (org-agenda-overriding-header "High Priority Tasks:")))
            (agenda "")
            (alltodo "")))))
#+end_src

*** Org Super Agenda


Enhance agenda views with automatic grouping and filtering.

org-super-agenda provides flexible, customizable grouping for agenda items. It works by filtering items after org-agenda builds the view, allowing you to organize tasks by priority, tags, deadlines, and more.

See the [[https://github.com/alphapapa/org-super-agenda][official documentation]] for advanced grouping options.

#+begin_src emacs-lisp
;; Enhanced agenda grouping with org-super-agenda
(use-package org-super-agenda
  :straight t
  :after org
  :config
  (org-super-agenda-mode 1)

  ;; Group by priority and category
  (setq org-super-agenda-groups
        '((:name "High Priority"
           :priority "A"
           :order 1)
          (:name "Personal Knowledge Management"
           :category "pkm"
           :order 2)
          (:name "Getting Things Done"
           :category "gtd"
           :order 3)
          (:name "Everything Else"
           :anything t
           :order 99))))
#+end_src


** Capture Templates
Configure templates for quickly capturing notes and tasks.

#+begin_src emacs-lisp
;; Capture key binding
(define-key global-map (kbd "C-c c") 'org-capture)

;; Basic capture templates
(setq org-capture-templates
      '(("t" "todo" entry (file+headline "~/todo.org" "Tasks")
         "* TODO [#B] %?" :empty-lines-before 1)))
#+end_src

* Git Integration
Integrate Org mode with Git.

#+begin_src emacs-lisp
;; Git integration for Org
(use-package orgit
  :straight (orgit :type git :host github :repo "magit/orgit"))
#+end_src

* Auto-Tangle
Automatically tangle org files when saved.

#+begin_src emacs-lisp
;; ===============================================================================
;; Setup auto-tangle for org files
;; ===============================================================================

(use-package org-auto-tangle
  :straight t
  :hook (org-mode . org-auto-tangle-mode))
;; enable in a doc with #+auto_tangle: t
;; enable in all buffers with org-auto-tangle-default
#+end_src

* Additional Packages
Various packages that enhance the Org mode experience.

** Org Transclusion
Include content from other Org files.

#+begin_src emacs-lisp
;; ===============================================================================
;; Setup Org Transclude
;; ===============================================================================

(use-package org-transclusion
  :straight t
  :after org)
#+end_src

** Corg Completions
Better completions for org-babel and dynamic blocks.

#+begin_src emacs-lisp
;; ===============================================================================
;; Install corg for org-babel and dynamic block completions
;; ===============================================================================
(use-package corg
  :straight (:host github :repo "isamert/corg.el"))
#+end_src

** Org Noter
Annotate PDFs with Org mode.

#+begin_src emacs-lisp
;; ===============================================================================
;; Install org noter for annotating pdf files
;; ===============================================================================

(use-package org-noter
  :straight t)
#+end_src

** Org Download
Easily drag-and-drop images into Org files.

#+begin_src emacs-lisp
;; ===============================================================================
;; Install org-download
;; ===============================================================================

(use-package org-download
  :straight t)
#+end_src

** Ob Async
Execute asynchronous org-babel source blocks.

#+begin_src emacs-lisp
;; ===============================================================================
;; Install ob-async for async babel execution
;; ===============================================================================

(use-package ob-async
  :straight t
  :config)
  ;; Uncomment to disable async for specific languages
  ;(setq ob-async-no-async-languages-alist '("ipython"))
#+end_src
